[{"id":"1","attributes":{"title":"Domestic Violence Fatality Review","slug":"index","hideFromSearch":false,"hideFromSitemap":false,"showTableOfContents":true,"summary":"Illinois Domestic Violence Fatality Review Home","body":":home-text\n\n\n ","section":"root","createdAt":"2023-02-06T17:29:48.970Z","updatedAt":"2023-03-11T21:35:04.164Z","publishedAt":"2023-02-06T17:30:10.310Z","searchMeta":"home dvfr index ","category":"page","rawText":" home text ","draft":false,"navigation":true,"path":"/","url":"https://dvfr.illinois.gov"}},{"id":"2","attributes":{"title":"About us","slug":"about","hideFromSearch":false,"hideFromSitemap":false,"showTableOfContents":true,"summary":"The Domestic Violence Fatality Review Act (Public Act 102-0520) was signed into law in August 2021 creating a process to establish domestic violence fatality review (DVFR) teams across Illinois.","body":"<style>\n\nul.member-list {\n  -webkit-columns: 1;\n  -moz-columns: 1;\n  columns: 1;\n  padding-left: 0;\n  list-style-type: none;\n  \n}\nul.member-list li {\n  list-style-position: inside;\n  -webkit-column-break-inside: avoid;\n  page-break-inside: avoid;\n  break-inside: avoid;\n  padding: 10px;\n}\n\n@media only screen and (min-width: 768px) {\n  ul.member-list {\n    -webkit-columns: 2;\n    -moz-columns: 2;\n    columns: 2;\n    padding-left: 0;\n  }\n}\n\n@media only screen and (min-width: 1024px) {\n  ul.member-list {\n    -webkit-columns: 3;\n    -moz-columns: 3;\n    columns: 3;\n    padding-left: 0;\n  }\n}\n\n</style>\n\n\n\n\nThe Domestic Violence Fatality Review Act (Public Act 102-0520) was signed into law in August 2021 creating a process to establish domestic violence fatality review (DVFR) teams across Illinois.\n\n## What is fatality review?\n\nFatality reviews consist of multi-disciplinary, multi-agency teams of stakeholders working together to examine data from a variety of sources to piece together the days, months, and years leading up to a person’s death.\n\nDomestic Violence Fatality Review aims to prevent future domestic violence related fatalities and near fatalities and reduce the severity and frequency of domestic violence. This process is accomplished by looking at both strengths and vulnerabilities in various intervention that may lead to adverse outcomes for survivors, victims, and their families.\n\nFatality review teams have been established in other fields, including those specific to fatalities involving child victims, elderly abuse and neglect, aviation, and more recently, deaths related to the opioid epidemic.\n\n## Statewide DVFR Committee\n\nThe Statewide Domestic Violence Fatality Review Committee is responsible for overseeing the formation of regional domestic violence review teams across Illinois and providing technical assistance and support to those teams. The Statewide Committee will gather policy and system recommendations from each regional review team and make collective recommendations The Committee will serve as a statewide resource for addressing domestic violence-related fatalities and near-fatalities.\n\n<div class='pl-0'>\n\n### Officers\n\n**Megan Alderdan, Ph.D., Co-Chair**\n\nDr. Megan Alderdan is an Associate Professor of Criminology at DePaul University. Her areas of expertise include research methods and program evaluation, victimology, and policing. She was a co-Investigator on two National Institute of Justice funded projects examining the impact of forensic evidence on police and prosecutorial decisions and court outcomes in sexual assault cases. Currently, she is a co-investigator on a federally funded project that focuses on educating and training laypersons, practitioners, and mental health professionals on how to identify and prevent targeted violence. She is the lead evaluator for a federally funded research project that aims to support and link recently incarcerated individuals with job training and employment. She is the Board President for the Justice Research and Statistics Association and the co-chair of the Illinois Domestic Violence Fatality Review Commission.   \n\nPrior to joining DePaul University, she was the Associate Director of Research with the Illinois Criminal Justice Information Authority (ICJIA), a state agency dedicated to improving the administration of justice in Illinois. As the ICJIA Research Director, she oversaw a wide portfolio of research projects that spanned from victim services to effective correctional practices and policies.  \n\t\n**Sara Block, Co-Chair**\n\nSara Block is the Managing Director of Advocacy and Partnerships at Ascend Justice where she focuses on policy and systemic reform that impact families experiencing domestic violence. Sara is also the Academic Director for Child and Family Law Programs at Loyola University Chicago School of Law. In the Master of Jurisprudence in Child Law program at Loyola, Sara teaches Child Welfare Law and Policy, and Juvenile Justice Law Policy. Sara was a Skadden Fellow at the Legal Assistance Foundation of Metropolitan Chicago with a fellowship focusing on the intersection of domestic violence and child welfare. Sara was awarded the Chicago Metropolitan Battered Women’s Network’s Outstanding Partnership Award, the Family Defense Center’s Major Litigation Award for her involvement in Julie Q. v. DCFS, and the Jewish United Fund’s “36 Under 36” award. Sara received her J.D., magna cum laude, from Loyola University Chicago School of Law in 2007, where she was a Child Law Fellow and the Features Editor of the Children’s Legal Rights Journal. Sara received her B.A. degree with honors in American Studies from Northwestern University. Sara is the author of the book entitled Together Unbroken: Stories, Law, Practice and Healing at the Intersection of Domestic Violence and Child Welfare. She has two daughters and feels honored to be their mother.  \n\n**Jenny Schoenwetter, Secretary**\n\nJenny Schoenwetter (pronounced “shane-wetter”) is the executive director and CEO of Harbor House, the only domestic violence agency serving Kankakee and Iroquois Counties. Jenny is a Certified Domestic Violence Professional and earned a Master’s in Business Administration degree. Jenny has received the Kankakee County Chamber of Commerce ATHENA Young Professionals Award in 2021, the Daily Journal’s Women in Business Honor in 2021, and United Way’s Rookie of the Year Award in 2016. \n\nJenny serves as a member of the Illinois Domestic Violence Fatality Review Committee and is co-chair of the Illinois Coalition Against Domestic Violence’s Funding Oversight Committee. Jenny served as a board member for the United Way of Kankakee & Iroquois Counties where she developed and launched Women United and the Zonta Club of Kankakee. She regularly leads professional trainings, serves on panels, and facilitates workshops and retreats locally and across the state. \n\n### Committee Members\n\nMembers are appointed in accordance with terms of the Domestic Violence Fatality Review Act, 750 ILCS 62. The membership of DVFRC is required to have racial, ethnic, gender, and geographic diversity.  \n\n<ul class=\"member-list text-center\">\n \n <li>\n  \n  **Dr. Megan Alderden, Co - Chair**\n  \n  Associate Professor of Criminology\n  \n  DePaul University\n  \n</li>\n <li>\n \n**Hon. Robert J. Anderson**\n  \nJudge, Retired\n\n18th Judicial Circuit Court\n\n</li>\n <li>\n \n**Willette Benford**\n \nSurvivor and Director of Re-Entry\n\nCity of Chicago\n\n\n \n </li>\n <li>\n \n **Sara Block, Co-Chair**\n \nManaging Director of Advocacy and Partnerships\n\nAscend Justice\n\n \n </li>\n <li>\n \n**Jennifer Cacciapaglia**\n\nExecutive Director\n\nMayor’s Office of Domestic Violence and Community Violence Prevention\n\nCity of Rockford\n\n \n </li>\n <li>\n \n**Wendy Cohen**\n\nSenior Policy Advisor\n\nOffice of the Illinois Attorney General\n\n\n \n </li>\n  <li>\n \n**Patrick Delfino**\n\nDirector\n\nIllinois State’s Attorney\n\nAppellate Prosecutor’s Office\n\n \n </li>\n  <li>\n \n**Dr. Thomas Golebiewski**\n\nL.C.S.W. in Private Practice Psychotherapy and Counseling\n\nAdjunct Professor at Loyola University School of Social Work\n\n \n </li>\n \n   <li>\n \n**Jennifer Greene**\n\nDirector of Policy and Advocacy\n\nLife Span\n\n\n \n </li>\n \n   <li>\n \n**Emily Harwell**\n\nPolicy Manager\n\nOffice of the Illinois Lt. Governor\n\n \n </li>\n \n   <li>\n \n**Meg Hefty**\n\nAssociate Director\n\nSarah’s Inn   \n\n \n </li>\n \n   <li>\n \n**Sheriff Andrew Hires**\n\nRichland County Sherriff\n\n\n \n </li>\n \n   <li>\n \n**Carolyn Klarquist**\n\nSupervisor & Assistant Defender\n\nOffice of the State Appellate Defender\n\n \n </li>\n \n   <li>\n \n**Major Dan Likens**\n\nIllinois State Police\n\nDivision of Criminal Investigations\n\n\n \n </li>\n \n   <li>\n \n**Jenna Lopez**\n\nSexual Assault & Legal Advocacy Program Manager\n\nYWCA Sauk Valley\n\n \n </li>\n \n <li>\n \n**Rep. Tony McCombie**\n\nHouse Republican Leader, 89th District\n\nIllinois House of Representatives\n\n \n </li>\n \n  <li>\n \n**Michelle Meyer**\n\nChief Executive Officer\n\nMutual Ground\n\n \n </li>\n \n  <li>\n \n**Emily Miller**\n\nSenior Advisor for Policy & Legislative Affairs\n\nOffice of the Illinois Governor\n\n \n </li>\n \n  <li>\n \n**Fawn Pettet**\n\nClient Support Services Manager\n\nLand of Lincoln Legal Aid\n\n \n </li>\n \n  <li>\n \n**Amanda Pyron**\n\nExecutive Director\n\nThe Network: Advocating Against Domestic Violence\n\n \n </li>\n \n  <li>\n \n**Jenny Schoenwetter, Secretary**\n\nExecutive Director and CEO\n\nHarbor House\n\n \n </li>\n \n  <li>\n \n**Stacy L. Short**\n\nAssociate Deputy Director\n\nChild Protection\n\nIllinois Department of Child and Family Services\n \n </li>\n \n  <li>\n \n**Vickie Smith**\n\nPresident and Chief Executive Officer\n\nIllinois Coalition Against\n\nDomestic Violence\n\n \n </li>\n \n  <li>\n  \n **Dr. Jacob Stelter**\n \n Attending Emergency Physician\n \n Northshore University Health System\n \n </li>\n \n  <li>\n \n**Cassandra Tanner Miller**\n\nSurvivor, DV Advocate and Founder\n\nColton’s Legacy\n\n \n </li>\n \n  <li>\n \n**Teresa L. Tudor**\n\nProgram Administrator\n\nIllinois Department of Human Services\n\n \n </li>\n \n  <li>\n \n**Sen. Sally J. Turner**\n\nCaucus Whip, 44th District\n\nIllinois Senate\n\n \n </li>\n \n  <li>\n \n**Jennifer Vancil**\n\nChief Operating Officer\n\nQuincy Area Network Against Domestic Violence\n\n \n </li>\n \n  <li>\n \n**Amanda L. Vasquez**\n\nActing Research Manager\n\nResearch & Analysis Unit\n\nCenter for Victim Studies\n\nIllinois Criminal Justice Information Authority\n\n\n \n </li>\n \n  <li>\n \n**Sen. Celina Villanueva**\n\nSenator, 12th District\n\nIllinois Senate\n\n\n \n </li>\n \n  <li>\n \n**Tom Weitzel**\n\nChief of Police, Retired\n\nRiverside Police Department\n\n \n </li>\n \n  <li>\n \n**Rep. Maurice A. West II**\n\nRepresentative, 67th District\n\nIllinois House of Representatives\n\n\n \n </li>\n \n  <li>\n \n**Jeanine Woods**\n\nExecutive Director\n\nCairo Women’s Shelter, Inc. \n\n \n </li>\n \n </ul>\n\n</div>\n\n## Regional DVFR Teams \n\nRegional Domestic Violence Fatality Review Teams are responsible for conducting a designated number of comprehensive individual case reviews quarterly. These cases will consist of fatalities and near-fatalities that are believed to be the result of domestic violence, including overdoses and suicides. As part of these in-depth case reviews, teams will collect and review a variety of records, conduct interviews, look at victim/survivor/abuser contact with various systems, and identify both vulnerabilities and strengths in the intervention process.\n\nTeams will use their findings to identify opportunities for improvement in domestic violence intervention strategies and systems collaboration and make annual recommendations to the Statewide Committee. \n\nTeams must be organized by circuit court boundaries but may be formed as county, jurisdiction, beat, or neighborhood specific. \n\nThe Statewide DVFR Committee is actively recruiting stakeholder groups in Illinois that are interested in forming a domestic violence fatality review team in their area. For more information, please email us at [fatalityreview@ilcadv.org](mailto:fatalityreview@ilcadv.org).\n\n\n- Location 1 TBD (coming soon)\n\n-  Location 2 TBD\n\n- Location 3 TBD\n\n- Location 4 TBD\n\n\n\n\n\n\n\n\n","section":"root","createdAt":"2023-02-06T17:32:54.095Z","updatedAt":"2023-03-12T16:30:50.398Z","publishedAt":"2023-02-06T17:32:55.127Z","searchMeta":"icjia Megan Alderdan Sara Block Jenny Schoenwetter ","category":"page","rawText":" ul member list webkit columns 1 moz columns 1 columns 1 padding left 0 list style type none ul member list li list style position inside webkit column break inside avoid page break inside avoid break inside avoid padding 10px media only screen and min width 768px ul member list webkit columns 2 moz columns 2 columns 2 padding left 0 media only screen and min width 1024px ul member list webkit columns 3 moz columns 3 columns 3 padding left 0 the domestic violence fatality review act public act 102 0520 was signed into law in august 2021 creating a process to establish domestic violence fatality review dvfr teams across illinois what is fatality review fatality reviews consist of multi disciplinary multi agency teams of stakeholders working together to examine data from a variety of sources to piece together the days months and years leading up to a person s death domestic violence fatality review aims to prevent future domestic violence related fatalities and near fatalities and reduce the severity and frequency of domestic violence this process is accomplished by looking at both strengths and vulnerabilities in various intervention that may lead to adverse outcomes for survivors victims and their families fatality review teams have been established in other fields including those specific to fatalities involving child victims elderly abuse and neglect aviation and more recently deaths related to the opioid epidemic statewide dvfr committee the statewide domestic violence fatality review committee is responsible for overseeing the formation of regional domestic violence review teams across illinois and providing technical assistance and support to those teams the statewide committee will gather policy and system recommendations from each regional review team and make collective recommendations the committee will serve as a statewide resource for addressing domestic violence related fatalities and near fatalities officers megan alderdan ph d co chair dr megan alderdan is an associate professor of criminology at depaul university her areas of expertise include research methods and program evaluation victimology and policing she was a co investigator on two national institute of justice funded projects examining the impact of forensic evidence on police and prosecutorial decisions and court outcomes in sexual assault cases currently she is a co investigator on a federally funded project that focuses on educating and training laypersons practitioners and mental health professionals on how to identify and prevent targeted violence she is the lead evaluator for a federally funded research project that aims to support and link recently incarcerated individuals with job training and employment she is the board president for the justice research and statistics association and the co chair of the illinois domestic violence fatality review commission prior to joining depaul university she was the associate director of research with the illinois criminal justice information authority icjia a state agency dedicated to improving the administration of justice in illinois as the icjia research director she oversaw a wide portfolio of research projects that spanned from victim services to effective correctional practices and policies sara block co chair sara block is the managing director of advocacy and partnerships at ascend justice where she focuses on policy and systemic reform that impact families experiencing domestic violence sara is also the academic director for child and family law programs at loyola university chicago school of law in the master of jurisprudence in child law program at loyola sara teaches child welfare law and policy and juvenile justice law policy sara was a skadden fellow at the legal assistance foundation of metropolitan chicago with a fellowship focusing on the intersection of domestic violence and child welfare sara was awarded the chicago metropolitan battered women s network s outstanding partnership award the family defense center s major litigation award for her involvement in julie q v dcfs and the jewish united fund s 36 under 36 award sara received her j d magna cum laude from loyola university chicago school of law in 2007 where she was a child law fellow and the features editor of the children s legal rights journal sara received her b a degree with honors in american studies from northwestern university sara is the author of the book entitled together unbroken stories law practice and healing at the intersection of domestic violence and child welfare she has two daughters and feels honored to be their mother jenny schoenwetter secretary jenny schoenwetter pronounced shane wetter is the executive director and ceo of harbor house the only domestic violence agency serving kankakee and iroquois counties jenny is a certified domestic violence professional and earned a master s in business administration degree jenny has received the kankakee county chamber of commerce athena young professionals award in 2021 the daily journal s women in business honor in 2021 and united way s rookie of the year award in 2016 jenny serves as a member of the illinois domestic violence fatality review committee and is co chair of the illinois coalition against domestic violence s funding oversight committee jenny served as a board member for the united way of kankakee iroquois counties where she developed and launched women united and the zonta club of kankakee she regularly leads professional trainings serves on panels and facilitates workshops and retreats locally and across the state committee members members are appointed in accordance with terms of the domestic violence fatality review act 750 ilcs 62 the membership of dvfrc is required to have racial ethnic gender and geographic diversity dr megan alderden co chair associate professor of criminology depaul university hon robert j anderson judge retired 18th judicial circuit court willette benford survivor and director of re entry city of chicago sara block co chair managing director of advocacy and partnerships ascend justice jennifer cacciapaglia executive director mayor s office of domestic violence and community violence prevention city of rockford wendy cohen senior policy advisor office of the illinois attorney general patrick delfino director illinois state s attorney appellate prosecutor s office dr thomas golebiewski l c s w in private practice psychotherapy and counseling adjunct professor at loyola university school of social work jennifer greene director of policy and advocacy life span emily harwell policy manager office of the illinois lt governor meg hefty associate director sarah s inn sheriff andrew hires richland county sherriff carolyn klarquist supervisor assistant defender office of the state appellate defender major dan likens illinois state police division of criminal investigations jenna lopez sexual assault legal advocacy program manager ywca sauk valley rep tony mccombie house republican leader 89th district illinois house of representatives michelle meyer chief executive officer mutual ground emily miller senior advisor for policy legislative affairs office of the illinois governor fawn pettet client support services manager land of lincoln legal aid amanda pyron executive director the network advocating against domestic violence jenny schoenwetter secretary executive director and ceo harbor house stacy l short associate deputy director child protection illinois department of child and family services vickie smith president and chief executive officer illinois coalition against domestic violence dr jacob stelter attending emergency physician northshore university health system cassandra tanner miller survivor dv advocate and founder colton s legacy teresa l tudor program administrator illinois department of human services sen sally j turner caucus whip 44th district illinois senate jennifer vancil chief operating officer quincy area network against domestic violence amanda l vasquez acting research manager research analysis unit center for victim studies illinois criminal justice information authority sen celina villanueva senator 12th district illinois senate tom weitzel chief of police retired riverside police department rep maurice a west ii representative 67th district illinois house of representatives jeanine woods executive director cairo women s shelter inc regional dvfr teams regional domestic violence fatality review teams are responsible for conducting a designated number of comprehensive individual case reviews quarterly these cases will consist of fatalities and near fatalities that are believed to be the result of domestic violence including overdoses and suicides as part of these in depth case reviews teams will collect and review a variety of records conduct interviews look at victim survivor abuser contact with various systems and identify both vulnerabilities and strengths in the intervention process teams will use their findings to identify opportunities for improvement in domestic violence intervention strategies and systems collaboration and make annual recommendations to the statewide committee teams must be organized by circuit court boundaries but may be formed as county jurisdiction beat or neighborhood specific the statewide dvfr committee is actively recruiting stakeholder groups in illinois that are interested in forming a domestic violence fatality review team in their area for more information please email us at fatalityreview ilcadv org mailto fatalityreview ilcadv org location 1 tbd coming soon location 2 tbd location 3 tbd location 4 tbd ","draft":false,"navigation":true,"path":"/about","url":"https://dvfr.illinois.gov/about"}},{"id":"3","attributes":{"title":"State of Illinois Privacy Policy","slug":"privacy","hideFromSearch":false,"hideFromSitemap":false,"showTableOfContents":true,"summary":"Access to the State of Illinois websites is provided subject to the following terms and conditions.","body":"Access to the State of Illinois websites is provided subject to the following terms and conditions. Please read these terms carefully as use of these sites constitutes acceptance of all of the following terms and conditions:\n\n## Disclaimer of Liability\n\nNeither the State of Illinois, nor any of its agencies nor any of its employees shall be held liable for any improper or incorrect use of the information described and/or contained herein and assumes no responsibility for anyone's use of the information. In no event shall the State web site or its employees be liable for any direct, indirect, incidental, special, exemplary, or consequential damages (including, but not limited to, procurement or substitute goods or services; loss of use, data, or profits; or business interruption) however caused and on any theory of liability, whether in contract, strict liability, or tort (including negligence or otherwise) arising in any way out of the use of this system, even if advised of the possibility of such damage. This disclaimer of liability applies to any damages or injury, including but not limited to those caused by any failure of performance, error, omission, interruption, deletion, defect, delay in operation or transmission, computer virus, communication line failure, theft or destruction or unauthorized access to, alteration of, or use of record, whether for breach of contract, tortious behavior, negligence or under any other cause of action.\n\n## Disclaimer of Warranties and Accuracy of Data\n\nAlthough the data found using the State of Illinois' access systems has been produced and processed from sources believed to be reliable, no warranty, expressed or implied, is made regarding accuracy, adequacy, completeness, legality, reliability or usefulness of any information. This disclaimer applies to both isolated and aggregate uses of the information. The State provides this information on an \"as is\" basis. All warranties of any kind, express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, freedom from contamination by computer viruses and non-infringement of proprietary rights are disclaimed. Changes may be periodically made to the information herein; these changes may or may not be incorporated in any new version of the publication. If you have obtained information from any of the State's web pages from a source other than the State pages, be aware that electronic data can be altered subsequent to original distribution. Data can also quickly become out of date. It is recommended that careful attention be paid to the contents of any data associated with a file, and that the originator of the data or information be contacted with any questions regarding appropriate use. If you find any errors or omissions, we encourage you to report them to webmaster@illinois.gov via email.\n\n## Disclaimer of Endorsement\n\nThe State of Illinois is a distributor of content sometimes supplied by third parties and users. Any opinions, advice, statements, services, offers, or other information or content expressed or made available by third parties, including information provided by users, or others, are those of the respective author(s) or distributor(s) and do not necessarily state or reflect those of the State of Illinois and shall not be used for advertising or product endorsement purposes. Reference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the State.\n\n## Disclaimer for External Links\n\nThe State of Illinois is not responsible for the contents of any off-site pages referenced. The user specifically acknowledges that the State is not liable for the defamatory, offensive, or illegal conduct of other users, links, or third parties and that the risk of injury from the foregoing rests entirely with the user. Links from the State of Illinois' web pages on the World Wide Web to other sites do not constitute an endorsement from the State. These links are provided as an information service only. It is the responsibility of the web surfer to evaluate the content and usefulness of information obtained from other sites. The State's web site contains links to other related World Wide Web Internet sites and resources. Since the State's web site is not responsible for the availability of these outside resources or their contents, you should direct any concerns regarding any external link to its site administrator or webmaster.\n\n## Disclaimer of Duty to Continue Provision of Data\n\nDue to the dynamic nature of the Internet, resources that are free and publicly available one day may require a fee or restricted access the next, and the location of items may change as menus, homepages, and files are reorganized. The user expressly agrees that use of the State's web site is at the user's sole risk. The State does not warrant that the service will be uninterrupted or error free. The documents and related graphics published on this server could contain technical inaccuracies or typographical errors. Changes are periodically added to the information herein. The State and/or its respective agencies and programs may make improvements and/or changes in the information and/or programs described herein at any time.\n\n## Security\n\nThe Department of Innovation & Technology (DoIT), as developer and manager of this web site, has taken several steps to safeguard the integrity of its communications and computing infrastructure, including but not limited to authentication, monitoring, auditing, and encryption. Security measures have been integrated into the design, implementation and day-to-day practices of the entire (DoIT) operating environment as part of its continuing commitment to risk management.\n\nThis information should not be construed in any way as giving business, legal, or other advice, or warranting as fail proof, the security of information provided via (DoIT) supported web sites .\n\n## Google Analytics\n\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses \"cookies\", which are text files placed on your computer, to help the website analyze how users use the site. The information generated by the cookie about your use of the website (including your IP address) will be transmitted to and stored by Google on servers in the United States . Google will use this information for the purpose of evaluating your use of the website, compiling reports on website activity for website operators and providing other services relating to website activity and internet usage. Google may also transfer this information to third parties where required to do so by law, or where such third parties process the information on Google's behalf. Google will not associate your IP address with any other data held by Google. You may refuse the use of cookies by selecting the appropriate settings on your browser, however please note that if you do this you may not be able to use the full functionality of this website. By using this website, you consent to the processing of data about you by Google in the manner and for the purposes set out above.\n\n## Choice of Law\n\nConstruction of the disclaimers above and resolution of disputes thereof are governed by the laws of the State of Illinois. The laws of the State of Illinois, U.S.A., shall apply to all uses of this data and this system. By use of this system and any data contained therein, the user agrees that use shall conform to all applicable laws and regulations and user shall not violate the rights of any third parties.","section":"root","createdAt":"2023-02-06T17:36:01.722Z","updatedAt":"2023-02-10T13:55:31.746Z","publishedAt":"2023-02-06T17:36:02.857Z","searchMeta":"cookies analytics tracking ","category":"page","rawText":"access to the state of illinois websites is provided subject to the following terms and conditions please read these terms carefully as use of these sites constitutes acceptance of all of the following terms and conditions disclaimer of liability neither the state of illinois nor any of its agencies nor any of its employees shall be held liable for any improper or incorrect use of the information described and or contained herein and assumes no responsibility for anyone s use of the information in no event shall the state web site or its employees be liable for any direct indirect incidental special exemplary or consequential damages including but not limited to procurement or substitute goods or services loss of use data or profits or business interruption however caused and on any theory of liability whether in contract strict liability or tort including negligence or otherwise arising in any way out of the use of this system even if advised of the possibility of such damage this disclaimer of liability applies to any damages or injury including but not limited to those caused by any failure of performance error omission interruption deletion defect delay in operation or transmission computer virus communication line failure theft or destruction or unauthorized access to alteration of or use of record whether for breach of contract tortious behavior negligence or under any other cause of action disclaimer of warranties and accuracy of data although the data found using the state of illinois access systems has been produced and processed from sources believed to be reliable no warranty expressed or implied is made regarding accuracy adequacy completeness legality reliability or usefulness of any information this disclaimer applies to both isolated and aggregate uses of the information the state provides this information on an as is basis all warranties of any kind express or implied including but not limited to the implied warranties of merchantability fitness for a particular purpose freedom from contamination by computer viruses and non infringement of proprietary rights are disclaimed changes may be periodically made to the information herein these changes may or may not be incorporated in any new version of the publication if you have obtained information from any of the state s web pages from a source other than the state pages be aware that electronic data can be altered subsequent to original distribution data can also quickly become out of date it is recommended that careful attention be paid to the contents of any data associated with a file and that the originator of the data or information be contacted with any questions regarding appropriate use if you find any errors or omissions we encourage you to report them to webmaster illinois gov via email disclaimer of endorsement the state of illinois is a distributor of content sometimes supplied by third parties and users any opinions advice statements services offers or other information or content expressed or made available by third parties including information provided by users or others are those of the respective author s or distributor s and do not necessarily state or reflect those of the state of illinois and shall not be used for advertising or product endorsement purposes reference herein to any specific commercial products process or service by trade name trademark manufacturer or otherwise does not constitute or imply its endorsement recommendation or favoring by the state disclaimer for external links the state of illinois is not responsible for the contents of any off site pages referenced the user specifically acknowledges that the state is not liable for the defamatory offensive or illegal conduct of other users links or third parties and that the risk of injury from the foregoing rests entirely with the user links from the state of illinois web pages on the world wide web to other sites do not constitute an endorsement from the state these links are provided as an information service only it is the responsibility of the web surfer to evaluate the content and usefulness of information obtained from other sites the state s web site contains links to other related world wide web internet sites and resources since the state s web site is not responsible for the availability of these outside resources or their contents you should direct any concerns regarding any external link to its site administrator or webmaster disclaimer of duty to continue provision of data due to the dynamic nature of the internet resources that are free and publicly available one day may require a fee or restricted access the next and the location of items may change as menus homepages and files are reorganized the user expressly agrees that use of the state s web site is at the user s sole risk the state does not warrant that the service will be uninterrupted or error free the documents and related graphics published on this server could contain technical inaccuracies or typographical errors changes are periodically added to the information herein the state and or its respective agencies and programs may make improvements and or changes in the information and or programs described herein at any time security the department of innovation technology doit as developer and manager of this web site has taken several steps to safeguard the integrity of its communications and computing infrastructure including but not limited to authentication monitoring auditing and encryption security measures have been integrated into the design implementation and day to day practices of the entire doit operating environment as part of its continuing commitment to risk management this information should not be construed in any way as giving business legal or other advice or warranting as fail proof the security of information provided via doit supported web sites google analytics this website uses google analytics a web analytics service provided by google inc google google analytics uses cookies which are text files placed on your computer to help the website analyze how users use the site the information generated by the cookie about your use of the website including your ip address will be transmitted to and stored by google on servers in the united states google will use this information for the purpose of evaluating your use of the website compiling reports on website activity for website operators and providing other services relating to website activity and internet usage google may also transfer this information to third parties where required to do so by law or where such third parties process the information on google s behalf google will not associate your ip address with any other data held by google you may refuse the use of cookies by selecting the appropriate settings on your browser however please note that if you do this you may not be able to use the full functionality of this website by using this website you consent to the processing of data about you by google in the manner and for the purposes set out above choice of law construction of the disclaimers above and resolution of disputes thereof are governed by the laws of the state of illinois the laws of the state of illinois u s a shall apply to all uses of this data and this system by use of this system and any data contained therein the user agrees that use shall conform to all applicable laws and regulations and user shall not violate the rights of any third parties ","draft":false,"navigation":true,"path":"/privacy","url":"https://dvfr.illinois.gov/privacy"}},{"id":"5","attributes":{"title":"Resources","slug":"resources","hideFromSearch":false,"hideFromSitemap":false,"showTableOfContents":true,"summary":"Publications and additional resources for DVFR","body":"## Publications\n\n### Annual Reports\n\n- 2022 Annual Report (coming soon)\n\n### Forms\n\n- Review Team Confidentiality Form (coming soon)\n\n## Program Partners\n\n[Illinois Coalition Against Domestic Violence (ICADV)](https://www.ilcadv.org) &nbsp;&raquo;\n\nThe Illinois Coalition Against Domestic Violence is a statewide voice for survivors of domestic violence and their children. ICADV’s member organizations provide direct service to survivors to work toward ending domestic violence in Illinois. \n\n[Illinois Criminal Justice Information Authority (ICJIA)](https://icjia.illinois.gov)&nbsp;&raquo;\n\nThe Illinois Criminal Justice Information Authority is a state agency dedicated to improving the administration of criminal justice. ICJIA brings together key leaders from the justice system and the public to identify critical issues faced by the criminal justice system in Illinois and to propose and evaluate policies, programs, and legislation that address those issues. The agency also works to ensure the criminal justice system in Illinois is efficient, effective, and equitable.\n\n[National Domestic Violence Fatality Review Initiative](https://www.ndvfri.org)&nbsp;&raquo;\n\nThe National Domestic Violence Fatality Review Initiative provides technical assistance for the review of domestic violence-related deaths in order to help prevent them in the future, preserve the safety of battered women, and hold accountable both the perpetrators of domestic violence and the multiple agencies and organizations that come into contact with the parties.\t\n\n## Additional Resources\n\n[National Coalition Against Domestic Violence (NCADV)](http://www.ncadv.org/)&nbsp;&raquo;\n\nThe National Coalition Against Domestic Violence’s mission is to lead, mobilize and raise voices to support efforts that demand a change in conditions that lead to domestic violence such as patriarchy, privilege, racism, sexism, and classism. NCADV is dedicated to supporting survivors and holding offenders accountable. \n\n[Illinois Crime Victims’ Compensation Act](https://ag.state.il.us/victims/cvc.html)&nbsp;&raquo;\n\nSurvivors of domestic violence-related crimes often face a long emotionally and physically painful road to recovery. In the aftermath of a devastating crime that has taken or nearly taken a loved one, expenses can quickly pile up. If you have been a victim of crime or if you have lost a family member to a violent crime, you may be eligible for the Illinois Crime Victims Compensation Program. \n\n**Illinois Domestic Violence Hotline**  \n\nIf you are experiencing domestic violence, the 24-Hour Illinois Domestic Violence Crisis Hotline can provide you with support, information, and referrals for a wide range of services. You do not need to leave your abuser or your home to receive help. All services are both free and confidential.  \n\n**1-877-863-6338** (Voice) \n","section":"root","createdAt":"2023-02-16T02:07:30.063Z","updatedAt":"2023-03-09T14:29:15.548Z","publishedAt":"2023-02-16T02:07:31.228Z","searchMeta":null,"category":"page","rawText":" publications annual reports 2022 annual report coming soon forms review team confidentiality form coming soon program partners illinois coalition against domestic violence icadv https www ilcadv org nbsp raquo the illinois coalition against domestic violence is a statewide voice for survivors of domestic violence and their children icadv s member organizations provide direct service to survivors to work toward ending domestic violence in illinois illinois criminal justice information authority icjia https icjia illinois gov nbsp raquo the illinois criminal justice information authority is a state agency dedicated to improving the administration of criminal justice icjia brings together key leaders from the justice system and the public to identify critical issues faced by the criminal justice system in illinois and to propose and evaluate policies programs and legislation that address those issues the agency also works to ensure the criminal justice system in illinois is efficient effective and equitable national domestic violence fatality review initiative https www ndvfri org nbsp raquo the national domestic violence fatality review initiative provides technical assistance for the review of domestic violence related deaths in order to help prevent them in the future preserve the safety of battered women and hold accountable both the perpetrators of domestic violence and the multiple agencies and organizations that come into contact with the parties additional resources national coalition against domestic violence ncadv http www ncadv org nbsp raquo the national coalition against domestic violence s mission is to lead mobilize and raise voices to support efforts that demand a change in conditions that lead to domestic violence such as patriarchy privilege racism sexism and classism ncadv is dedicated to supporting survivors and holding offenders accountable illinois crime victims compensation act https ag state il us victims cvc html nbsp raquo survivors of domestic violence related crimes often face a long emotionally and physically painful road to recovery in the aftermath of a devastating crime that has taken or nearly taken a loved one expenses can quickly pile up if you have been a victim of crime or if you have lost a family member to a violent crime you may be eligible for the illinois crime victims compensation program illinois domestic violence hotline if you are experiencing domestic violence the 24 hour illinois domestic violence crisis hotline can provide you with support information and referrals for a wide range of services you do not need to leave your abuser or your home to receive help all services are both free and confidential 1 877 863 6338 voice ","draft":false,"navigation":true,"path":"/resources","url":"https://dvfr.illinois.gov/resources"}},{"id":"7","attributes":{"title":"Contact","slug":"contact","hideFromSearch":false,"hideFromSitemap":false,"showTableOfContents":true,"summary":"DVFR Contact information","body":"## Illinois Domestic Violence Crisis Hotline\n\nThe 24-Hour Illinois Domestic Violence Crisis Hotline can provide support, information, and referral for a wide range of services. You do not need to leave your abuser or your home to receive help. All services are both free and confidential.\n\n\n**1-877-TO END DV**\n\n(1-877-863-6338)\n\n## Statewide Domestic Violence Fatality Review Committee\n\nPhone: 217-789-2830\n\nFatalityReview@ilcadv.org\n\n## Illinois Criminal Justice Information Authority\n\n60 E. Van Buren Blvd, 6th Floor \n\nChicago, Illinois 60605\n\nPhone: 312-793-8550\n\ncja.info@illinois.gov\n\nhttps://icjia.illinois.gov\n\n\n","section":"root","createdAt":"2023-02-16T02:10:40.943Z","updatedAt":"2023-03-17T16:15:04.266Z","publishedAt":"2023-02-16T02:10:42.140Z","searchMeta":"how to contact ","category":"page","rawText":" illinois domestic violence crisis hotline the 24 hour illinois domestic violence crisis hotline can provide support information and referral for a wide range of services you do not need to leave your abuser or your home to receive help all services are both free and confidential 1 877 to end dv 1 877 863 6338 statewide domestic violence fatality review committee phone 217 789 2830 fatalityreview ilcadv org illinois criminal justice information authority 60 e van buren blvd 6th floor chicago illinois 60605 phone 312 793 8550 cja info illinois gov https icjia illinois gov ","draft":false,"navigation":true,"path":"/contact","url":"https://dvfr.illinois.gov/contact"}}]
